Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/kata/tomcat/target_count_13/repeat_14/13.txt
2020/01/26 16:09:12 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8013/
2020/01/26 16:09:42 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 70522 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8013
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      70522
Failed requests:        0
Non-2xx responses:      70525
Total transferred:      61215700 bytes
HTML transferred:       50284325 bytes
Requests per second:    2350.73 [#/sec] (mean)
Time per request:       42.540 [ms] (mean)
Time per request:       0.425 [ms] (mean, across all concurrent requests)
Transfer rate:          1992.69 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14  69.8      3    3053
Processing:     0   27  57.1      7    1259
Waiting:        0   26  50.1      7     835
Total:          0   41  94.9     11    3057
Percentage of the requests served within a certain time (ms)
  50%     11
  66%     23
  75%     40
  80%     54
  90%    101
  95%    167
  98%    283
  99%    381
 100%   3057 (longest request)
2020/01/26 16:09:42 Matched stat line [Connect:        0   14  69.8      3    3053 Connect 0 14 69.8 3 3053]
2020/01/26 16:09:42 Matched stat line [Processing:     0   27  57.1      7    1259 Processing 0 27 57.1 7 1259]
2020/01/26 16:09:42 Matched stat line [Waiting:        0   26  50.1      7     835 Waiting 0 26 50.1 7 835]
2020/01/26 16:09:42 Matched stat line [Total:          0   41  94.9     11    3057 Total 0 41 94.9 11 3057]
2020/01/26 16:09:42 Matched percentline [  50%     11 50 11]
2020/01/26 16:09:42 Matched percentline [  66%     23 66 23]
2020/01/26 16:09:42 Matched percentline [  75%     40 75 40]
2020/01/26 16:09:42 Matched percentline [  80%     54 80 54]
2020/01/26 16:09:42 Matched percentline [  90%    101 90 101]
2020/01/26 16:09:42 Matched percentline [  95%    167 95 167]
2020/01/26 16:09:42 Matched percentline [  98%    283 98 283]
2020/01/26 16:09:42 Matched percentline [  99%    381 99 381]
2020/01/26 16:09:42 Matched percentline [ 100%   3057 100 3057]
{"connect":{"max":3053,"mean":14,"median":3,"min":0,"stdDev":69.80000305175781},"percentiles":{"100":3057,"50":11,"66":23,"75":40,"80":54,"90":101,"95":167,"98":283,"99":381},"processing":{"max":1259,"mean":27,"median":7,"min":0,"stdDev":57.099998474121094},"total":{"max":3057,"mean":41,"median":11,"min":0,"stdDev":94.9000015258789},"waiting":{"max":835,"mean":26,"median":7,"min":0,"stdDev":50.099998474121094}}